mainster/sw4stm32_workbench/20-STM32F4_PRJ_GALVO_v2/src/adc_dac_dma.c
/**
 * @file        adc_dac_dma.c
 *
 * @date        30 Jan 2017
 * @author      Manuel Del Basso (mainster)
 * @email       manuel.delbasso@gmail.com
 *
 * @ide         System Workbench ac6 (eclipse stm32)
 * @stdperiph   STM32F4xx Standard peripheral drivers version 1.4.0 or greater required
 * @license		GNU GPL v3
 *
  @verbatim

	Copyright (C) 2016	Manuel Del Basso

	This program is free software: you can redistribute it and/or modify
	it under the terms of the GNU General Public License as published by
	the Free Software Foundation, either version 3 of the License, or
	(at your option) any later version.

	This program is distributed in the hope that it will be useful,
	but WITHOUT ANY WARRANTY; without even the implied warranty of
	MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
	GNU General Public License for more details.
	You should have received a copy of the GNU General Public License
	along with this program.  If not, see <http://www.gnu.org/licenses/>.

	@endverbatim
 *
 */
#include "adc_dac_dma.h"


//autoSaveSystem_t ASG;
extern autoSaveSystem_t ASG;

/**
 * @addtogroup MD_APP
 * @{
 */

/**
 * @addtogroup APP_Analog
 * @{
 */

/**
 * @addtogroup Analog_Variables
 * @{
 */

/**
 * @brief      Definition of DAC Write Access pointer.
 *
 *             Use this function pointer to provide unprivileged, secure write
 *             access to the DAC hardware. When the ASG enters the system into
 *             fault state, the pointer reference changes to the ASG-tripped
 *             function" DAC_SetDualChanSigned_Tripped from which all actuator
 *             control signals are forced to output a predefined, safe value.
 *
 * @param[in]  Raw   DAC compensator algorithm output value for channel 2.
 * @param[in]  Raw   DAC compensator algorithm output value for channel 1.
 */
DAC_WP_t (*DAC_SecureSetDualChanSigned) (int16_t, int16_t);

/** @} */

/** @} */

/** @} */

DAC_WP_t DAC_SetDualChanSigned(int16_t Data2, int16_t Data1) {
  // ===========================================================================
  //        DO NOT ACCESS THIS FUNCTION BY DIRECT FUNCTION CALL !!!
  // ===========================================================================
  
  /* TODO:  Implement active range checks */  
  DAC_SetDualChannelData(DAC_Align_12b_R, Data2 + AN_BIAS_INT, Data1 + AN_BIAS_INT);
  return DEFAULT_WRITE_DAC;
}


/* ===========================================================================
 *  DAC_SetDualChanSigned_Tripped() defines the error condition function
 *  Point to this function if an ASS error conditon (i.e. Tripped) ocured 
 * =========================================================================== */
DAC_WP_t DAC_SetDualChanSigned_Tripped(int16_t dummy1, int16_t dummy2) {
  uint16_t data2, data1;

  data2 = decode_toUint(ASG.safeVal + VA_BIAS);
  data1 = decode_toUint(ASG.safeVal + VA_BIAS);

  DAC_SetDualChannelData( DAC_Align_12b_R, data2, data1);

  return TRIPPED_WRITE_DAC;
}

/**
 * Timer-triggered ADC-scan mode with DMA to memory
 * --------------------------------------------------
 *
 * remember:    - once initialized, first ADC conversion must be started
 *                by a ADC_SoftwareStartConv(ADC1) or whereever the first 
 *                channel of the regular group runs (ADC1 ,2 ,3)
 *
 *  - Timer controlled group scan restart is configured by
 *    *.ADC_ExternalTrigConv = ADC_ExternalTrigConv_T2_TRGO; This means NOT that 
 *    start-events for ADC regular scan are generated by the Timer update ISR!!!
 *    Configure TIM for generating Output Trigger events!
 *    TIM_SelectOutputTrigger(TIM2,TIM_TRGOSource_Update);
 * 
 *    @param    memSize is an integer value, the DMA controller transfers memSize
 *              datagrams befor circulating. Also memSize ADC regular channels have
 *              to be configured within this init procedure (ADC_RegularChannelConfig)
 */          

/* ====================================================================================  
                    Enable AN, GPIO, TIM and DMA clocks
   ==================================================================================== */ 
void RCC_Configuration(void) {
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA2, ENABLE);
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC, ENABLE);
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1, ENABLE);
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);
}

/* ====================================================================================  
                    ADC common and regular scan group init
   ==================================================================================== */ 
void ADC_Configuration(void)
{
  ADC_CommonInitTypeDef ADC_CommonInitStructure;
  ADC_InitTypeDef ADC_InitStructure;
  
    /* ADC Common Init */
  ADC_CommonInitStructure.ADC_Mode = ADC_Mode_Independent;
  ADC_CommonInitStructure.ADC_Prescaler = ADC_Prescaler_Div2;
  ADC_CommonInitStructure.ADC_DMAAccessMode = ADC_DMAAccessMode_Disabled;
  ADC_CommonInitStructure.ADC_TwoSamplingDelay = ADC_TwoSamplingDelay_5Cycles;
  ADC_CommonInit(&ADC_CommonInitStructure);

  ADC_InitStructure.ADC_Resolution = ADC_Resolution_12b;
  ADC_InitStructure.ADC_ScanConvMode = ENABLE;
  ADC_InitStructure.ADC_ContinuousConvMode = DISABLE;
  ADC_InitStructure.ADC_ExternalTrigConvEdge = ADC_ExternalTrigConvEdge_Rising;
  ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_T2_TRGO;
  ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
    ADC_InitStructure.ADC_NbrOfConversion = 0x02; /* 5 channels in total */
  ADC_Init(ADC1, &ADC_InitStructure);

    /* ADC1 regular channel selection 
     * @NOTE Changes to this config affects the channel index for ADC_MultiConvBuff[ ]
     * in the PID algorithm function */
  ADC_RegularChannelConfig(ADC1, ADC_X_CHAN , 1, ADC_SampleTime_3Cycles);         
  ADC_RegularChannelConfig(ADC1, ADC_Y_CHAN , 2, ADC_SampleTime_3Cycles); 
//    ADC_RegularChannelConfig(ADC1, ADC_Ix_CHAN, 3, ADC_SampleTime_3Cycles); 
//    ADC_RegularChannelConfig(ADC1, ADC_W_CHAN , 4, ADC_SampleTime_3Cycles);

    /* Enable DMA request after last transfer (Single-ADC mode) */
  ADC_DMARequestAfterLastTransferCmd(ADC1, ENABLE);

    /* Enable ADC1 DMA */
  ADC_DMACmd(ADC1, ENABLE);

    /* Enable ADC1 */
  ADC_Cmd(ADC1, ENABLE);
}

/* ====================================================================================  
                    Configure ADC Analog watchdog 
   ==================================================================================== */
void AnalogWatchdog_Configuration (void) {
  ADC_AnalogWatchdogSingleChannelConfig(ADC1, ADC_Y_CHAN);
  ADC_AnalogWatchdogThresholdsConfig(ADC1, 0x7ff, 0);
  ADC_AnalogWatchdogCmd(ADC1, ADC_AnalogWatchdog_SingleRegEnable);
//  ADC_AnalogWatchdogCmd(ADC1, ADC_AnalogWatchdog_AllRegEnable);
}    

/* ====================================================================================  
                    DMA2 Stream0 channel0 configuration  
   ==================================================================================== */ 
void DMA_Configuration( __IO int16_t *MultiConvBuff, uint8_t memSize) {
  DMA_InitTypeDef DMA_InitStructure;

