mainster/sw4stm32_workbench/20-STM32F4_PRJ_GALVO_v2/src/adc_dac_dma.c
    /* Initialise DMA */
  DMA_StructInit(&DMA_InitStructure);

    /* config DMA Controller */
    DMA_InitStructure.DMA_Channel = DMA_Channel_0; /* See Tab 20 */
    DMA_InitStructure.DMA_BufferSize = memSize; /* 5 * memsize */
    DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralToMemory; /* direction */

    /* 
     *if 4 or more channels / conversions take place, enable FIFO 
    DMA_InitStructure.DMA_FIFOMode = DMA_FIFOMode_Enabled; 
    DMA_InitStructure.DMA_FIFOThreshold = 1/4 oder so; 
     */
    DMA_InitStructure.DMA_FIFOMode = DMA_FIFOMode_Disable; /* no FIFO */
  DMA_InitStructure.DMA_FIFOThreshold = 0;
  DMA_InitStructure.DMA_MemoryBurst = DMA_MemoryBurst_Single;
  DMA_InitStructure.DMA_PeripheralBurst = DMA_PeripheralBurst_Single;
    DMA_InitStructure.DMA_Mode = DMA_Mode_Circular; /* circular buffer */
    DMA_InitStructure.DMA_Priority = DMA_Priority_High; /* high priority */

    /* config target memory */
    DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t)MultiConvBuff; /* target addr */
    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord; /* 16 bit */
  DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
  DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)&ADC1->DR;
  DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
  DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    DMA_Init(DMA2_Stream0, &DMA_InitStructure); /* See Table 20 for mapping */

    /* Enable DMA Stream Half / Transfer Complete interrupt */
  DMA_ITConfig(DMA2_Stream0, DMA_IT_TC | DMA_IT_HT, ENABLE);

  DMA_Cmd(DMA2_Stream0, ENABLE);
}



void TIM2_DMA_triggerConfiguration(FunctionalState TimerRun, \
  FunctionalState IntOn, uint16_t peri) {	
  TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;
  
  /* Time base configuration */
  TIM_TimeBaseStructInit(&TIM_TimeBaseStructure);
  TIM_TimeBaseStructure.TIM_Period = peri; 
  TIM_TimeBaseStructure.TIM_Prescaler = 1;
  TIM_TimeBaseStructure.TIM_ClockDivision = 0;
  TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
  TIM_TimeBaseInit(TIM2, &TIM_TimeBaseStructure);
  
  /* TIM2 TRGO selection */
  TIM_SelectOutputTrigger(TIM2, TIM_TRGOSource_Update); // ADC_ExternalTrigConv_T2_TRGO
  TIM_ITConfig(TIM2, TIM_IT_Update, IntOn);	
  /* TIM2 enable counter */
  TIM_Cmd(TIM2, TimerRun);
}

/**
 * @brief      Nested vector interrupt controller initialisation.
 */
void NVIC_Configuration(void) {
  /**
    * @brief      { item_description }
    */ 
  NVIC_InitTypeDef  
  NVIC_InitStruct_DMA,
  NVIC_InitStruct_TIM,
  NVIC_InitStruct_ADC;
  
  /* Enable the DMA Stream IRQ Channel */
  NVIC_InitStruct_DMA.NVIC_IRQChannel = DMA2_Stream0_IRQn;
  NVIC_InitStruct_DMA.NVIC_IRQChannelPreemptionPriority = 2;
  NVIC_InitStruct_DMA.NVIC_IRQChannelSubPriority = 1;
  NVIC_InitStruct_DMA.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStruct_DMA);
  
  /* Enable the TIM2 IRQ Channel */
  NVIC_InitStruct_TIM.NVIC_IRQChannel = TIM2_IRQn;
  NVIC_InitStruct_TIM.NVIC_IRQChannelPreemptionPriority = 0;
  NVIC_InitStruct_TIM.NVIC_IRQChannelSubPriority = 0;
  NVIC_InitStruct_TIM.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStruct_TIM);

    /* ADC Analog watchdog interrupt enable */
  NVIC_InitStruct_ADC.NVIC_IRQChannel = ADC_IRQn;
  NVIC_InitStruct_ADC.NVIC_IRQChannelPreemptionPriority = 0;
  NVIC_InitStruct_ADC.NVIC_IRQChannelSubPriority = 0;
  NVIC_InitStruct_ADC.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStruct_ADC);
  ADC_ITConfig(ADC1, ADC_IT_AWD, ENABLE);

}


/*  ====================================================================================  
    ====================================================================================  
    ====================================================================================  
    ====================================================================================  
    ====================================================================================  
    ====================================================================================  
    ====================================================================================  
    ====================================================================================  
    ====================================================================================  
    ====================================================================================  
    ====================================================================================  
    ====================================================================================  
    ====================================================================================  
    ====================================================================================  
    ==================================================================================== */ 



#ifdef ADC_DMA_BIS_19_05_2015
void ADC_ContScanMode_w_DMA_timeTrigd ( __IO int16_t *MultiConvBuff, 
 uint8_t memSize) {

/* ====================================================================================  
                    Define init structures
   ==================================================================================== */ 
  ADC_InitTypeDef         ADC_InitStructure;
  ADC_CommonInitTypeDef   ADC_CommonInitStructure;
  DMA_InitTypeDef         DMA_InitStructure;
  GPIO_InitTypeDef        GPIO_InitStructure;
  NVIC_InitTypeDef        NVIC_InitStructure;

   /* Enable timer as It's update interrupt is used to trigger a new 
    * regular channel conversion sequence */

/* ====================================================================================  
                    Enable AN GPIO and DMA clocks
   ==================================================================================== */ 
  RCC_AHB1PeriphClockCmd(  RCC_AHB1Periph_GPIOB |
    RCC_AHB1Periph_GPIOC |
    RCC_AHB1Periph_DMA2, ENABLE);

/* ====================================================================================  
                    ADC GPIO init
   ==================================================================================== */ 
  GPIO_StructInit(&GPIO_InitStructure);
  GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_3; 
  GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AIN;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
  GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_NOPULL;
  GPIO_Init(GPIOC, &GPIO_InitStructure);

  GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_3 | GPIO_Pin_6 ; 
  GPIO_Init(GPIOA, &GPIO_InitStructure);

