mainster/sw4stm32_workbench/20-STM32F4_PRJ_GALVO_v2/src/adc_dac_dma.c
  GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_0 ; 
  GPIO_Init(GPIOB, &GPIO_InitStructure);

/* ====================================================================================  
                    DMA2 Stream0 channel0 configuration  
   ==================================================================================== */ 
    /* Initialise DMA */
  DMA_StructInit(&DMA_InitStructure);

    /* config DMA Controller */
    DMA_InitStructure.DMA_Channel = DMA_Channel_0; /* See Tab 20 */
    DMA_InitStructure.DMA_BufferSize = memSize; /* 5 * memsize */
    DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralToMemory; /* direction */
    DMA_InitStructure.DMA_FIFOMode = DMA_FIFOMode_Disable; /* no FIFO */
  DMA_InitStructure.DMA_FIFOThreshold = 0;
  DMA_InitStructure.DMA_MemoryBurst = DMA_MemoryBurst_Single;
  DMA_InitStructure.DMA_PeripheralBurst = DMA_PeripheralBurst_Single;
    DMA_InitStructure.DMA_Mode = DMA_Mode_Circular; /* circular buffer */
    DMA_InitStructure.DMA_Priority = DMA_Priority_High; /* high priority */
    /* config receive memory */
    DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t)MultiConvBuff; /* target addr */
    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord; /* 16 bit */
  DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
  DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)&ADC1->DR;
  DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
  DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    DMA_Init(DMA2_Stream0, &DMA_InitStructure); /* See Table 20 for mapping */
  DMA_Cmd(DMA2_Stream0, ENABLE);

/* ====================================================================================  
                    DMA transmission-complete interrupt config
   ==================================================================================== */
/**< configure nested vectored interrupt controller for DMA transmission complete
     * High priority needed because TC IRQ determines the output sample precision
     * through DAC hardware components. */
  DMA_ITConfig(DMA2_Stream0, DMA_IT_TC, ENABLE);
  DMA_ClearITPendingBit(DMA2_Stream0, DMA_IT_TC);

  NVIC_InitStructure.NVIC_IRQChannel = DMA2_Stream0_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 5;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 6;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);

/* ====================================================================================  
                    ADC common init
   ==================================================================================== */ 
    /* IMPORTANT: populate default values before use */
  ADC_StructInit(&ADC_InitStructure);
  ADC_CommonStructInit(&ADC_CommonInitStructure);

    /* reset configuration if needed, could be used for previous init */
  ADC_Cmd(ADC1, DISABLE);
  ADC_DeInit();

    /* init ADC clock */
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1, ENABLE);

    /* init ADC */
  ADC_CommonInitStructure.ADC_Mode = ADC_Mode_Independent;
  ADC_CommonInitStructure.ADC_Prescaler = ADC_Prescaler_Div2;

    /* Yes, ADC_DMAAccessMode_Disabled is correct */
  ADC_CommonInitStructure.ADC_DMAAccessMode = ADC_DMAAccessMode_Disabled;
  ADC_CommonInitStructure.ADC_TwoSamplingDelay = ADC_TwoSamplingDelay_5Cycles;
  ADC_CommonInit(&ADC_CommonInitStructure);

/* ====================================================================================  
                    ADC regular channel config
   ==================================================================================== */ 
    /* ADC1 Init: this is mostly done with ADC1->CR */
  ADC_InitStructure.ADC_Resolution = ADC_Resolution_12b;
  ADC_InitStructure.ADC_ScanConvMode = ENABLE;
  ADC_InitStructure.ADC_ContinuousConvMode = DISABLE;
  ADC_InitStructure.ADC_ExternalTrigConvEdge = ADC_ExternalTrigConvEdge_Rising;
  ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_T2_TRGO;
  ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
    ADC_InitStructure.ADC_NbrOfConversion = memSize; /* 5 channels in total */
  ADC_Init(ADC1, &ADC_InitStructure);

    /** Configure channels 
     * @NOTE Changes to this config affects the channel index for ADC_MultiConvBuff[ ]
     * in the PID algorithm function */
  ADC_RegularChannelConfig(ADC1, ADC_X_CHAN , 1, ADC_SampleTime_3Cycles);         
  ADC_RegularChannelConfig(ADC1, ADC_Y_CHAN , 2, ADC_SampleTime_3Cycles); 
  ADC_RegularChannelConfig(ADC1, ADC_Ix_CHAN, 3, ADC_SampleTime_3Cycles); 
  ADC_RegularChannelConfig(ADC1, ADC_W_CHAN , 4, ADC_SampleTime_3Cycles);

/* ....................................................................................  
                    ADC end-of-conversion interrupt config
   .................................................................................... */  
/*  
 * If higher ADCx used, remember to set IT_EOC config als to ADCx* /
    ADC_ITConfig(ADC1, ADC_IT_EOC, ENABLE);

    / **< configure vectored interrupt controller 
     * High priority needed because EOC IRQ determines the output sample precision
     * through DAC hardware components. * /
    NVIC_InitStructure.NVIC_IRQChannel = ADC_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0x02;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0x04;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);
    */


/* ====================================================================================  
                    Configure ADC Analog watchdog 
   ==================================================================================== */
  ADC_AnalogWatchdogSingleChannelConfig(ADC1, ADC_Y_CHAN);
  ADC_AnalogWatchdogThresholdsConfig(ADC1, 0x7ff, 0);
  ADC_AnalogWatchdogCmd(ADC1, ADC_AnalogWatchdog_SingleRegEnable);
//    ADC_AnalogWatchdogCmd(ADC1, ADC_AnalogWatchdog_AllRegEnable);

/* ====================================================================================  
                    ADC Analog watchdog interrupt enable
   ==================================================================================== */
  NVIC_InitStructure.NVIC_IRQChannel = ADC_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
  ADC_ITConfig(ADC1, ADC_IT_AWD, ENABLE);

    /* Enable DMA request after last transfer (Single-ADC mode) */
  ADC_DMARequestAfterLastTransferCmd(ADC1, ENABLE);

    /* Enable ADC1 DMA */


    /* in main */
//    TIM_Cmd(TIM2, ENABLE);
//    ADC_Cmd(ADC1, ENABLE);
//    ADC_SoftwareStartConv(ADC1);

